Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: receiving preprocessed data returned by the first server (S230), wherein the preprocessed data comprises an execution result of a target script file, and the target script file is a script file corresponding to a target page in the target quick application;
de_de: Empfangen vorverarbeiteter Daten, die von dem ersten Server zurückgegeben werden (S230), wobei die vorverarbeiteten Daten ein Ausführungsergebnis einer Zielskriptdatei umfassen und die Zielskriptdatei eine Skriptdatei ist, die einer Zielseite in der Zielschnellanwendung entspricht;

source: sending an application package download request corresponding to the target quick application to a second server (S250)
de_de: Senden einer Download-Anforderung für ein Anwendungspaket, das der Zielschnellanwendung entspricht, an einen zweiten Server (S250).

source: receiving an application package that is of the target quick application and that is returned by the second server (S260);
de_de: Empfangen eines Anwendungspakets, das von der Zielschnellanwendung ist und vom zweiten Server zurückgegeben wird (S260);

source: generating and displaying the target page based on the preprocessed data (S240); and
de_de: Generieren und Anzeigen der Zielseite basierend auf den vorverarbeiteten Daten (S240); und

source: when the preprocessed data does not exist in the first server, generating and displaying the target page of the target quick application based on the application package of the target quick application (S270).
de_de: wenn die vorverarbeiteten Daten auf dem ersten Server nicht vorhanden sind, Generieren und Anzeigen der Zielseite der Zielschnellanwendung basierend auf dem Anwendungspaket der Zielschnellanwendung (S270).

source: 2. The method according to claim 1, wherein the execution result comprises a first instruction and a second instruction, the first instruction is an execution result corresponding to an executed script instruction in the target script file, and the second instruction is a to-be-executed script instruction in the target script file; and
de_de: 2. Verfahren nach Anspruch 1, wobei das Ausführungsergebnis eine erste Anweisung und eine zweite Anweisung umfasst, wobei die erste Anweisung ein Ausführungsergebnis ist, das einer ausgeführten Skriptanweisung in der Zielskriptdatei entspricht, und die zweite Anweisung eine auszuführende Skriptanweisung in der Zielskriptdatei ist; und

source: the generating and displaying the target page based on the preprocessed data (S240) comprises:
de_de: das Erzeugen und Anzeigen der Zielseite basierend auf den vorverarbeiteten Daten (S240) umfasst:

source: executing the second instruction through a script engine, to obtain a third instruction; and
de_de: Ausführen der zweiten Anweisung durch eine Skript-Engine, um eine dritte Anweisung zu erlangen; und

source: generating and displaying the target page according to the first instruction and the third instruction.
de_de: Generieren und Anzeigen der Zielseite gemäß der ersten Anweisung und der dritten Anweisung.

source: 3. The method according to claim 2, wherein an input parameter in the second instruction comprises a device parameter of the terminal device and/or running data provided by a third-party server corresponding to the target quick application.
de_de: 3. Verfahren nach Anspruch 2, wobei ein Eingabeparameter in der zweiten Anweisung einen Geräteparameter des Endgeräts und/oder laufende Daten umfasst, die von einem Drittanbieterserver bereitgestellt werden und der Zielschnellanwendung entsprechen.

source: 4. The method according to claim 2 or 3, wherein the second instruction comprises a to-be-executed tag, and when the to-be-executed tag is detected, the terminal device executes, through the script engine, the second instruction corresponding to the detected to-be-executed tag.
de_de: 4. Verfahren nach Anspruch 2 oder 3, wobei die zweite Anweisung ein auszuführendes Tag umfasst und wenn das auszuführende Tag erkannt wird, das Endgerät über die Skript-Engine die zweite Anweisung ausführt, die dem erkannten auszuführenden Tag entspricht.

source: 5. The method according to any one of claims 1 to 4, wherein when the preprocessed data exists in the first server, the preprocessed-data request is sent to the first server.
de_de: 5. Verfahren nach einem der Ansprüche 1 bis 4, wobei, wenn die vorverarbeiteten Daten auf dem ersten Server vorhanden sind, die Anforderung vorverarbeiteter Daten an den ersten Server gesendet wird.

source: 6. The method according to any one of claims 1 to 5, wherein the target page is a home page of the target quick application.
de_de: 6. Verfahren nach einem der Ansprüche 1 bis 5, wobei die Zielseite eine Homepage der Zielschnellanwendung ist.

source: 7. The method according to claim 1, wherein the terminal device determines, based on a quick application list preprocessing result, whether the preprocessed data exists in the first server, and the quick application list preprocessing result is obtained by the terminal device from the first server; and
de_de: 7. Verfahren nach Anspruch 1, wobei das Endgerät basierend auf einem Vorverarbeitungsergebnis einer Schnellanwendungsliste bestimmt, ob die vorverarbeiteten Daten im ersten Server vorhanden sind, und das Endgerät das Vorverarbeitungsergebnis einer Schnellanwendungsliste von dem ersten Server erhält; und

source: the quick application list preprocessing result comprises a preprocessing result of at least one quick application, and a preprocessing result of each quick application indicates whether an execution result of a script file corresponding to a home page of the quick application exists in the first server.
de_de: das Vorverarbeitungsergebnis der Schnellanwendungsliste ein Vorverarbeitungsergebnis von mindestens einer Schnellanwendung umfasst und ein Vorverarbeitungsergebnis jeder Schnellanwendung angibt, ob ein Ausführungsergebnis einer Skriptdatei, die einer Homepage der Schnellanwendung entspricht, auf dem ersten Server vorhanden ist.

source: 8. A quick application processing method to improve a page display speed of a quick application, applied to a first server and a second server, wherein the method comprises:
de_de: 8. Verfahren zur Schnellanwendungsverarbeitung, um eine Seitenanzeigegeschwindigkeit einer Schnellanwendung zu verbessern, das auf einem ersten Server und einem zweiten Server angewendet wird, wobei das Verfahren umfasst:

source: receiving (S220), by the first server, a preprocessed-data request that corresponds to a target quick application and that is sent by a terminal device;
de_de: Empfangen (S220), durch den ersten Server, einer Anforderung vorverarbeiteter Daten, die einer Zielschnellanwendung entspricht und von einem Endgerät gesendet wird;

source: returning (S230), by the first server, preprocessed data corresponding to the preprocessed-data request to the terminal device, wherein the preprocessed data comprises an execution result of a target script file, and the target script file is a script file corresponding to a target page;
de_de: Zurückgeben (S230), durch den ersten Server, vorverarbeiteter Daten die der Anforderung vorverarbeiteter Daten entsprechen, an das Endgerät, wobei die vorverarbeiteten Daten ein Ausführungsergebnis einer Zielskriptdatei umfassen und die Zielskriptdatei eine Skriptdatei ist, die einer Zielseite entspricht;

source: receiving (S250), by the second server, an application package download request sent by the terminal device;
de_de: Empfangen (S250), durch den zweiten Server, einer Download-Anforderung für ein Anwendungspaket, die durch das Endgerät gesendet wird;

source: returning (S260), by the second server, the application package corresponding to the application package download request to the terminal device, such that
de_de: Zurücksenden (S260), durch den zweiten Server, des Anwendungspakets, das der Download-Anforderung für ein Anwendungspaket entspricht, an das Endgerät, derart dass

source: the target page is generated and displayed by the terminal device based on the preprocessed data (S240); and
de_de: die Zielseite von dem Endgerät basierend auf den vorverarbeiteten Daten generiert und angezeigt wird (S240); und

source: when the preprocessed data does not exist in the first server, the target page of the target quick application is generated and displayed by the terminal device based on the application package of the target quick application (S270).
de_de: wenn die vorverarbeiteten Daten auf dem ersten Server nicht vorhanden sind, die Zielseite der Zielschnellanwendung basierend auf dem Anwendungspaket der Zielschnellanwendung generiert und angezeigt wird (S270).

source: 9. The method according to claim 8, wherein the execution result comprises a first instruction and a second instruction, the first instruction is an execution result corresponding to an executed script instruction in the target script file, and the second instruction is a to-be-executed script instruction in the target script file.
de_de: 9. Verfahren nach Anspruch 8, wobei das Ausführungsergebnis eine erste Anweisung und eine zweite Anweisung umfasst, wobei die erste Anweisung ein Ausführungsergebnis ist, das einer ausgeführten Skriptanweisung in der Zielskriptdatei entspricht, und die zweite Anweisung eine auszuführende Skriptanweisung in der Zielskriptdatei ist.

source: The method according to claim 9, wherein an input parameter in the second instruction comprises a device parameter of the terminal device and/or running data provided by a third-party server corresponding to the target quick application.
de_de: Verfahren nach Anspruch 9, wobei ein Eingabeparameter in der zweiten Anweisung einen Geräteparameter des Endgeräts und/oder laufende Daten umfasst, die von einem Drittanbieterserver bereitgestellt werden und der Zielschnellanwendung entsprechen.

source: The method according to any one of claims 8 to 10, wherein before the receiving a preprocessed-data request that corresponds to a target quick application and that is sent by a terminal device, the method further comprises:
de_de: Verfahren gemäß einem der Ansprüche 8 bis 10, wobei das Verfahren vor dem Empfangen einer Anforderung vorverarbeiteter Daten, die einer Zielschnellanwendung entspricht und von einem Endgerät gesendet wird, ferner umfasst:

source: determining the target script file based on an application package of the target quick application; and
de_de: Bestimmen der Zielskriptdatei basierend auf einem Anwendungspaket der Zielschnellanwendung; und

source: executing the target script file through a script engine, to obtain the execution result of the target script file.
de_de: Ausführen der Zielskriptdatei über eine Skript-Engine, um das Ausführungsergebnis der Zielskriptdatei zu erlangen.

source: sending a quick application list preprocessing result to the terminal device, wherein the quick application list preprocessing result comprises a preprocessing result of at least one quick application, and a preprocessing result of each quick application indicates whether an execution result of a script file corresponding to a home page of the quick application exists in the first server.
de_de: Senden eines Vorverarbeitungsergebnisses einer Schnellanwendungsliste an das Endgerät, wobei das Vorverarbeitungsergebnis einer Schnellanwendungsliste ein Vorverarbeitungsergebnis von mindestens einer Schnellanwendung umfasst und ein Vorverarbeitungsergebnis jeder Schnellanwendung angibt, ob ein Ausführungsergebnis einer Skriptdatei, die einer Homepage der Schnellanwendung entspricht, auf dem ersten Server vorhanden ist.

source: The method according to any one of claims 1 to 12, wherein the first server is a quick application server, and the second server is an application market server.
de_de: Verfahren gemäß einem der Ansprüche 1 bis 12, wobei der erste Server ein Schnellanwendungsserver und der zweite Server ein Anwendungsmarktserver ist.

source: An electronic device, comprising a memory and a processor, wherein the memory is configured to store a computer program, and the processor is configured to perform the method according to any one of claims 1 to 12 when invoking the computer program.
de_de: Elektronische Vorrichtung, umfassend einen Speicher und einen Prozessor, wobei der Speicher konfiguriert ist, um ein Computerprogramm zu speichern und der Prozessor konfiguriert ist, um das Verfahren nach einem der Ansprüche 1 bis 12 durchzuführen, wenn das Computerprogramm aufgerufen wird.

source: 1. An electrical lead-out structure (15) configured for hermetic package, wherein the electrical lead-out structure comprises a flexible circuit board (151) and a packaging layer (155), the packaging layer (155) being configured to be soldered to a hermetic housing (11) to implement a hermetic connection between the electrical lead-out structure (15) and the hermetic housing (11), the flexible circuit board (151) comprises an electrical signal layer (1511) and a reinforcing layer (1513), the electrical signal layer (1511) and the reinforcing layer (1513) are stacked up, the electrical lead-out structure characterised in that
de_de: 1. Elektrische Ausleitungsstruktur (15), für eine luftdichte Verpackung konfiguriert, wobei die elektrische Ausleitungsstruktur eine flexible Leiterplatte (151) und eine Verpackungsschicht (155) umfasst, die Verpackungsschicht (155) konfiguriert ist, um an ein luftdichtes Gehäuse (11) gelötet zu sein, um eine luftdichte Verbindung zwischen der elektrischen Ausleitungsstruktur (15) und dem luftdichten Gehäuse (11) zu implementieren, die flexible Leiterplatte (151) eine elektrische Signalschicht (1511) und eine Verstärkungsschicht (1513) umfasst, wobei die elektrische Signalschicht (1511) und die Verstärkungsschicht (1513) gestapelt sind, wobei die elektrische Ausleitungsstruktur dadurch gekennzeichnet ist, dass

source: the reinforcing layer (1513) is provided with a window (1515) that passes through the reinforcing layer (1513), the electrical signal layer (1511) is adjacent to the window (1515), the packaging layer (155) fills the window (1515), and a side that is of the packaging layer (155) and that faces the electrical signal layer (1511) is provided insulated adjacent to the electrical signal layer (1511), wherein the packaging layer (155) comprises a glass substrate layer (1551) and a metal layer (1553) that are stacked up, the glass substrate layer (1551) fills the window (1515) in the reinforcing layer (1513), and the metal layer (1553) is disposed on a side that is of the glass substrate layer (1551) and that is away from the electrical signal layer (1511).
de_de: die Verstärkungsschicht (1513) mit einem Fenster (1515) bereitgestellt ist, das durch die Verstärkungsschicht (1513) verläuft, die elektrische Signalschicht (1511) dem Fenster (1515) benachbart ist, die Verpackungsschicht (155) das Fenster (1515) ausfüllt und eine Seite der Verpackungsschicht (155), die der elektrischen Signalschicht (1511) zugewandt ist, isoliert, der elektrischen Signalschicht (1511) benachbart, bereitgestellt ist, wobei die Verpackungsschicht (155) eine Glassubstratschicht (1551) und eine Metallschicht (1553) umfasst, die gestapelt sind, die Glassubstratschicht (1551) das Fenster (1515) in der Verstärkungsschicht (1513) ausfüllt und die Metallschicht (1553) auf einer Seite der Glassubstratschicht (1551) angeordnet ist, die von der elektrischen Signalschicht (1511) abgewandt ist.

source: 2. The electrical lead-out structure according to claim 1, wherein the glass substrate layer (1551) comprises a first connecting portion (1555) and a second connecting portion (1557), the first connecting portion is accommodated in the window, the second connecting portion covers a side that is of the first connecting portion and that is away from the electrical signal layer, and two end portions of the second connecting portion in an extension direction of the flexible circuit board always cover a side that is of the reinforcing layer and that is away from the electrical signal layer.
de_de: 2. Elektrische Ausleitungsstruktur nach Anspruch 1, wobei die Glassubstratschicht (1551) einen ersten Verbindungsabschnitt (1555) und einen zweiten Verbindungsabschnitt (1557) umfasst, wobei der erste Verbindungsabschnitt in dem Fenster untergebracht ist, der zweite Verbindungsabschnitt eine Seite des ersten Verbindungsabschnitts bedeckt, die von der elektrischen Signalschicht abgewandt ist, und zwei Endabschnitte des zweiten Verbindungsabschnitts in einer Erstreckungsrichtung der flexiblen Leiterplatte immer eine Seite der Verstärkungsschicht bedecken, die von der elektrischen Signalschicht abgewandt ist.

source: 3. The electrical lead-out structure according to any one of claims 1 to 2, wherein the electrical signal layer (1511) comprises a first surface (1516) and a second surface (1517) that are disposed opposite to each other, there are two reinforcing layers (1513), one of the reinforcing layers covers the first surface (1516), the other of the reinforcing layers covers the second surface (1517), and each of the two reinforcing layers is provided with the window (1515).
de_de: 3. Elektrische Ausleitungsstruktur nach einem der Ansprüche 1 bis 2, wobei die elektrische Signalschicht (1511) eine erste Oberfläche (1516) und eine zweite Oberfläche (1517) umfasst, die einander gegenüberliegend angeordnet sind, zwei Verstärkungsschichten (1513) vorhanden sind, wobei eine der Verstärkungsschichten die erste Oberfläche (1516) bedeckt, die andere der Verstärkungsschichten die zweite Oberfläche (1517) bedeckt, und jede der zwei Verstärkungsschichten mit dem Fenster (1515) bereitgestellt ist.

source: 4. The electrical lead-out structure according to claim 3, wherein a position of each window at one reinforcing layer corresponds to a position of one window at the other reinforcing layer, and the windows at the two reinforcing layers are arranged in a stacking direction of the electrical signal layer and the reinforcing layer.
de_de: 4. Elektrische Ausleitungsstruktur nach Anspruch 3, wobei eine Position jedes Fensters in einer Verstärkungsschicht einer Position eines Fensters in der anderen Verstärkungsschicht entspricht und die Fenster in den zwei Verstärkungsschichten in einer Stapelrichtung der elektrischen Signalschicht und der Verstärkungsschicht angeordnet sind.

source: 5. The electrical lead-out structure according to any one of claims 1 to 4, wherein the electrical lead-out structure further comprises an electrical connector (157), the electrical signal layer at a first end of the flexible circuit board in the extension direction of the flexible circuit board is configured to electrically connect to a functional component (13), and the electrical connector is fastened to and electrically connected to a second end of the flexible circuit board in the extension direction of the flexible circuit board.
de_de: 5. Elektrische Ausleitungsstruktur nach einem der Ansprüche 1 bis 4, wobei die elektrische Ausleitungsstruktur ferner einen elektrischen Verbinder (157) umfasst, die elektrische Signalschicht an einem ersten Ende der flexiblen Leiterplatte in Erstreckungsrichtung der flexiblen Leiterplatte konfiguriert ist, um sich elektrisch mit einer Funktionskomponente (13) zu verbinden, und der elektrische Verbinder an einem zweiten Ende der flexiblen Leiterplatte in Erstreckungsrichtung der flexiblen Leiterplatte befestigt und elektrisch verbunden ist.

source: 6. A hermetic apparatus (10), wherein the hermetic apparatus comprises a hermetic housing (11), a functional component (13), and the electrical lead-out structure (15) according to any one of claims 1 to 5, the hermetic housing (11) is provided with a connecting hole (113) that passes through a side wall of the hermetic housing (11), the functional component (13) is accommodated in the hermetic housing (11), the electrical lead-out structure (15) passes through the connecting hole (113), a side that is of a packaging layer (155) and that is away from an electrical signal layer (1511) is soldered to the hermetic housing (11), the electrical signal layer (1511) at a first end of a flexible circuit board (151) is electrically connected to the functional component (13), and a second end of the flexible circuit board (151) is exposed outside the hermetic housing (11).
de_de: 6. Luftdichte Vorrichtung (10), wobei die luftdichte Vorrichtung ein luftdichtes Gehäuse (11), eine Funktionskomponente (13) und die elektrische Ausleitungsstruktur (15) nach einem der Ansprüche 1 bis 5 umfasst, das luftdichte Gehäuse (11) mit einem Verbindungsloch (113) bereitgestellt ist, das durch eine Seitenwand des luftdichten Gehäuses (11) verläuft, die Funktionskomponente (13) in dem luftdichten Gehäuse (11) untergebracht ist, die elektrische Ausleitungsstruktur (15) durch das Verbindungsloch (113) verläuft, eine Seite einer Verpackungsschicht (155), die von einer elektrischen Signalschicht (1511) abgewandt ist, an das luftdichte Gehäuse (11) gelötet ist, die elektrische Signalschicht (1511) an einem ersten Ende einer flexiblen Leiterplatte (151) elektrisch mit der Funktionskomponente (13) verbunden ist und ein zweites Ende der flexiblen Leiterplatte (151) außerhalb des luftdichten Gehäuses (11) freiliegt.

source: 7. The hermetic apparatus according to claim 6, wherein the hermetic apparatus is a wavelength selective switch, and the functional component is configured to perform optical path conversion.
de_de: 7. Luftdichte Vorrichtung nach Anspruch 6, wobei die luftdichte Vorrichtung ein wellenlängenselektiver Schalter ist, und die Funktionskomponente konfiguriert ist, um eine optische Pfadumwandlung durchzuführen.

source: 8. A method for preparing an electrical lead-out structure according to claim 1, wherein the method comprises the following steps:
de_de: 8. Verfahren zur Herstellung einer elektrischen Ausleitungsstruktur nach Anspruch 1, wobei das Verfahren die folgenden Schritte umfasst:

source: forming (401), at a reinforcing layer of a flexible circuit board, a window that passes through the reinforcing layer, wherein the flexible circuit board comprises an electrical signal layer and the reinforcing layer covering the electrical signal layer; and
de_de: Bilden (401) eines Fensters an einer Verstärkungsschicht einer flexiblen Leiterplatte, das durch die Verstärkungsschicht verläuft, wobei die flexible Leiterplatte eine elektrische Signalschicht und die Verstärkungsschicht umfasst, die die elektrische Signalschicht bedeckt; und

source: filling (405) a packaging layer in the window, wherein a side that is of the packaging layer and that faces the electrical signal layer is provided insulated adjacent to the electrical signal layer, and insulates the electrical signal layer;
de_de: Ausfüllen (405) einer Verpackungsschicht in dem Fenster, wobei eine Seite der Verpackungsschicht, die der elektrischen Signalschicht zugewandt ist, isoliert, der elektrischen Signalschicht benachbart, bereitgestellt ist und die elektrische Signalschicht isoliert;

source: wherein before the filling a packaging layer in the window, the preparation method further comprises:
de_de: wobei das Herstellungsverfahren vor dem Ausfüllen einer Verpackungsschicht in dem Fenster ferner Folgendes umfasst:

source: forming (403) a metal layer on one side of a glass substrate layer, to form the packaging layer; and
de_de: Bilden (403) einer Metallschicht auf einer Seite einer Glassubstratschicht, um die Verpackungsschicht zu bilden; und
